<!DOCTYPE html>
<html lang="ja">
<head>
  <meta charset="utf-8">
  
<!-- Google tag (gtag.js) (Google Analytics)-->
<script async src="https://www.googletagmanager.com/gtag/js?id=G-RYH2QM54M7"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-RYH2QM54M7');
</script>
<!-- End Google tag (gtag.js) (Google Analytics) -->


  
  <title>&#39;切断されたメールボックス&#39; の表示について
 | Japan Exchange &amp; Outlook Support Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&#12371;&#12435;&#12395;&#12385;&#12399;&#12289;Exchange &#12469;&#12509;&#12540;&#12488; &#12481;&#12540;&#12512;&#12398;&#31481;&#26412;&#12391;&#12377;&#12290;&#20170;&#22238;&#12399;&#12289;&amp;#1251">
<meta property="og:type" content="article">
<meta property="og:title" content="&#39;切断されたメールボックス&#39; の表示について
">
<meta property="og:url" content="https://jpmessaging.github.io/blog/Display-disconnected-mailbox/index.html">
<meta property="og:site_name" content="Japan Exchange &amp; Outlook Support Blog">
<meta property="og:description" content="&#12371;&#12435;&#12395;&#12385;&#12399;&#12289;Exchange &#12469;&#12509;&#12540;&#12488; &#12481;&#12540;&#12512;&#12398;&#31481;&#26412;&#12391;&#12377;&#12290;&#20170;&#22238;&#12399;&#12289;&amp;#1251">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2014-04-23T15:00:00.000Z">
<meta property="article:modified_time" content="2014-04-23T15:00:00.000Z">
<meta property="article:author" content="jpmessaging">
<meta property="article:tag" content="Exchange">
<meta name="twitter:card" content="summary">
  
    <link rel="alternate" href="/blog/atom.xml" title="Japan Exchange &amp; Outlook Support Blog" type="application/atom+xml">
  
  
    <link rel="apple-touch-icon" sizes="180x180" href="/blog/icons/apple-touch-icon.png">
    <link rel="icon" type="image/png" sizes="32x32" href="/blog/icons/favicon-32x32.png">
    <link rel="icon" type="image/png" sizes="16x16" href="/blog/icons/favicon-16x16.png">
    <link rel="manifest" href="/blog/icons/site.webmanifest">
    <link rel="mask-icon" href="/blog/icons/safari-pinned-tab.svg" color="#5bbad5">
    <link rel="shortcut icon" href="/blog/icons/favicon.ico">
    <meta name="msapplication-TileColor" content="#2b5797">
    <meta name="msapplication-config" content="/blog/icons/browserconfig.xml">
    <meta name="theme-color" content="#ffffff">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  
<link rel="stylesheet" href="/blog/css/style.css">

<meta name="generator" content="Hexo 7.3.0"></head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="site-header-logo"></div>
  <div id="site-header-blog-wrapper"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/blog/" id="logo">Japan Exchange &amp; Outlook Support Blog</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/blog/" id="subtitle">日本マイクロソフト Exchange &amp; Outlook サポート チームのブログです</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/blog/">Home</a>
        
          <a class="main-nav-link" href="/blog/archives">Archives</a>
        
          <a class="main-nav-link" target="_blank" rel="noopener" href="https://cssjpn.github.io/">サポート情報</a>
        
          <a class="main-nav-link" target="_blank" rel="noopener" href="https://techcommunity.microsoft.com/t5/exchange-team-blog/bg-p/Exchange">US Exchange Blog</a>
        
          <a class="main-nav-link" target="_blank" rel="noopener" href="https://techcommunity.microsoft.com/t5/outlook-blog/bg-p/Outlook">US Outlook Blog</a>
        
          <a class="main-nav-link" href="/blog/about">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/blog/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="https://jpmessaging.github.io/blog"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-Display-disconnected-mailbox" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/blog/Display-disconnected-mailbox/" class="article-date">
  <time datetime="2014-04-23T15:00:00.000Z" itemprop="datePublished">2014-04-24</time>
</a>
    <!--  -->
  </div>
  <div class="article-inner">
    
    
      <header class="article-header-single">
        
  
    <h1 class="article-title" itemprop="name">
      &#39;切断されたメールボックス&#39; の表示について

    </h1>
  

      </header>
      <div class="article-share">
        Last Update:
        <a href="/blog/Display-disconnected-mailbox/" class="article-date-single">    
    
    <time datetime="2014-04-23T15:00:00.000Z" itemprop="dateUpdated">2014-04-24</time>
    
</a>
      </div>
    
    <div class="article-entry" itemprop="articleBody" style="overflow-wrap: break-word">
      
        <p>&#12371;&#12435;&#12395;&#12385;&#12399;&#12289;Exchange &#12469;&#12509;&#12540;&#12488; &#12481;&#12540;&#12512;&#12398;&#31481;&#26412;&#12391;&#12377;&#12290;<br>&#20170;&#22238;&#12399;&#12289;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398;&#28961;&#21177;&#21270;&#26178;&#12420;&#20877;&#25509;&#32154;&#26178;&#12395;&#24441;&#12395;&#31435;&#12388;&#12467;&#12510;&#12531;&#12489;&#12289;Clean-MailboxDatabase &#12395;&#12388;&#12356;&#12390;&#12372;&#26696;&#20869;&#12375;&#12414;&#12377;&#12290;<p>Exchange Server 2010 &#12408;&#12398;&#31227;&#34892;&#12420;&#36939;&#29992;&#12434;&#34892;&#12387;&#12390;&#12356;&#12383;&#12384;&#12356;&#12390;&#12356;&#12427;&#20013;&#12391;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#29694;&#35937;&#12395;&#36973;&#36935;&#12373;&#12428;&#12383;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12423;&#12358;&#12363;&#12290;</p><p>&#12288;&#12539; &#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12434;&#28961;&#21177;&#21270;&#12375;&#12383;&#12398;&#12395;&#12289;Exchange &#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#19978; "&#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;" &#12395;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;<br>&#12288;&#12539; &#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12434;&#20877;&#25509;&#32154;&#12375;&#12383;&#12398;&#12395;&#12289;&#12414;&#12384; "&#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;" &#12395;&#34920;&#31034;&#12373;&#12428;&#12383;&#12414;&#12414;&#12398;&#29366;&#24907;&#12364;&#35299;&#28040;&#12373;&#12428;&#12394;&#12356; <br>&#19978;&#35352;&#12398;&#12424;&#12358;&#12394;&#29694;&#35937;&#12364;&#30330;&#29983;&#12377;&#12427;&#22810;&#12367;&#12398;&#22580;&#21512;&#12289;&#23550;&#35937;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#12362;&#12356;&#12390;&#12399; AD&#19978;&#12398;&#24773;&#22577;&#12392; Exchange &#12473;&#12488;&#12450;&#19978;&#12398;&#24773;&#22577;&#12395;&#12289;&#19981;&#25972;&#21512;&#12394;&#29366;&#24907;&#12364;&#30330;&#29983;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p>&#20363;&#12360;&#12400;&#12289;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398;&#20999;&#26029; (Disable-Mailbox) &#12434;&#34892;&#12387;&#12383;&#22580;&#21512;&#12289;&#12414;&#12378;&#25509;&#32154;&#20808;&#12398;&#12518;&#12540;&#12470;&#12540; &#12450;&#12459;&#12454;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390; Exchange &#38306;&#36899;&#23646;&#24615;&#12434;&#21066;&#38500;&#12377;&#12427;&#20966;&#29702;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#32154;&#12369;&#12390;&#12289;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473; &#12469;&#12540;&#12496;&#12540;&#12399;&#12489;&#12513;&#12452;&#12531; &#12467;&#12531;&#12488;&#12525;&#12540;&#12521;&#12540;&#12434;&#21442;&#29031;&#12375;&#12289;&#12473;&#12488;&#12450;&#19978;&#12398;&#12381;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#26356;&#26032;&#12377;&#12427;&#20966;&#29702;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#26178;&#12289;AD &#12398;&#27083;&#25104;&#12420;&#35079;&#35069;&#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12473;&#12488;&#12450;&#12364;&#21442;&#29031;&#12375;&#12383;&#12489;&#12513;&#12452;&#12531; &#12467;&#12531;&#12488;&#12525;&#12540;&#12521;&#12540;&#12395;&#26368;&#26032;&#12398;&#32080;&#26524; (&#28961;&#21177;&#21270;&#12375;&#12383;&#24460;&#12398;&#29366;&#24907;) &#12364;&#21453;&#26144;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12289;&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12473;&#12488;&#12450;&#20869;&#12398;&#12487;&#12540;&#12479;&#12399;&#26356;&#26032;&#12373;&#12428;&#12378;&#12289;&#32080;&#26524;&#12392;&#12375;&#12390; "AD &#19978;&#12399;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12364;&#12289;&#12473;&#12488;&#12450;&#20869;&#12391;&#12399;&#26377;&#21177;&#12394;&#12414;&#12414;" &#12392;&#12356;&#12387;&#12383;&#29366;&#27841;&#12395;&#33267;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;<br>&#12414;&#12383;&#12371;&#12398;&#12424;&#12358;&#12394;&#29694;&#35937;&#12399;&#29305;&#12395;&#12289;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473; &#12469;&#12540;&#12496;&#12540;&#12392;&#12399;&#21029;&#12469;&#12452;&#12488;&#12398;&#12489;&#12513;&#12452;&#12531; &#12467;&#12531;&#12488;&#12525;&#12540;&#12521;&#12540;&#12395;&#23550;&#12375;&#12390; Disable-Mailbox &#31561;&#12398;&#12467;&#12510;&#12531;&#12489;&#12524;&#12483;&#12488;&#12434;&#23455;&#34892;&#12375;&#12383;&#22580;&#21512;&#31561;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p><p>&#12381;&#12375;&#12390;&#12371;&#12398;&#19981;&#25972;&#21512;&#12394;&#29366;&#24907;&#12434;&#35299;&#28040;&#12377;&#12427;&#12383;&#12417;&#12398;&#12467;&#12510;&#12531;&#12489;&#12364; Clean-MailboxDatabase &#12391;&#12377;&#12290;<br>&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12391; AD &#19978;&#12398;&#24773;&#22577;&#12398;&#20877;&#12473;&#12461;&#12515;&#12531;&#12364;&#23455;&#26045;&#12373;&#12428;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12473;&#12488;&#12450;&#20869;&#12398;&#24773;&#22577;&#12395;&#12388;&#12356;&#12390;&#12418;&#20877;&#26356;&#26032;&#12364;&#34892;&#12431;&#12428;&#12427;&#12383;&#12417;&#12289;&#19981;&#25972;&#21512;&#12394;&#29366;&#24907;&#12434;&#35299;&#28040;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p>&#12288;Clean-MailboxDatabase -id &lt;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;&gt;</p><p>&#26159;&#38750;&#12289;&#12362;&#35430;&#12375;&#12356;&#12383;&#12384;&#12369;&#12428;&#12400;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;<br>* &#12467;&#12510;&#12531;&#12489;&#21517;&#12363;&#12425;&#12399; DB &#12398;&#24773;&#22577;&#12434;&#21066;&#38500;&#12377;&#12427;&#12424;&#12358;&#12394;&#21360;&#35937;&#12434;&#12358;&#12369;&#12414;&#12377;&#12364;&#12289;&#12354;&#12367;&#12414;&#12391;&#12418;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398;&#19981;&#25972;&#21512;&#12394;&#29366;&#24907;&#12434;&#35299;&#28040;&#12377;&#12427;&#12383;&#12417;&#12398;&#12467;&#12510;&#12531;&#12489;&#12395;&#12394;&#12426;&#12414;&#12377;&#12398;&#12391;&#12289;&#12372;&#23433;&#24515;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>Clean-MailboxDatabase &#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#20197;&#19979;&#12418;&#20341;&#12379;&#12390;&#12372;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12288;Title : Clean-MailboxDatabase<br>&#12288;URL : <a target="_blank" rel="noopener" href="http://technet.microsoft.com/ja-jp/library/bb124076(v=exchg.141).aspx">http://technet.microsoft.com/ja-jp/library/bb124076(v=exchg.141).aspx</a></p><p>&#12394;&#12362;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12434;&#20316;&#25104;&#24460;&#12289;&#19968;&#24230;&#12418;&#12525;&#12464;&#12458;&#12531;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12420;&#19968;&#36890;&#12398;&#12513;&#12540;&#12523;&#12418;&#21463;&#20449;&#12375;&#12390;&#12356;&#12394;&#12356;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12434;&#28961;&#21177;&#21270;&#12375;&#12390;&#12418; "&#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;" &#12395;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#12473;&#12488;&#12450;&#20869;&#12395;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398;&#23455;&#20307;&#12364;&#12394;&#12356;&#12371;&#12392;&#12364;&#35201;&#22240;&#12392;&#12394;&#12426;&#12289;Clean-MailboxDatabase &#12434;&#23455;&#34892;&#12375;&#12390;&#12418;&#35299;&#28040;&#12373;&#12428;&#12414;&#12379;&#12435;&#12398;&#12391;&#12289;&#12372;&#27880;&#24847;&#12367;&#12384;&#12373;&#12356;&#12290;</p><hr style="width:100%;"><p><span style="color:#008000;">(2014/04/25 Update)</span></p><p>Exchange Server 2013 &#12391;&#12399; Clean-MailboxDatabase &#12467;&#12510;&#12531;&#12489;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12362;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#26032;&#12375;&#12367; Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#12372;&#21033;&#29992;&#12356;&#12383;&#12384;&#12369;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;<br>Exchange Server 2013 &#12391;&#12418;&#12289;Exchange Server 2010 &#12392;&#21516;&#27096;&#12395; AD&#19978;&#12398;&#24773;&#22577;&#12392; Exchange &#12473;&#12488;&#12450;&#19978;&#12398;&#24773;&#22577;&#12395;&#19981;&#25972;&#21512;&#12394;&#29366;&#24907;&#12364;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12398;&#12391;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#26178;&#12399; Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#23550;&#24540;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;</p><p>Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;AD &#19978;&#12398;&#24773;&#22577;&#12398;&#20877;&#12473;&#12461;&#12515;&#12531;&#12392;&#12473;&#12488;&#12450;&#20869;&#12398;&#24773;&#22577;&#12398;&#26356;&#26032;&#12434;&#12289;Clean-MailboxDatabase &#12467;&#12510;&#12531;&#12489;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#34892;&#12358;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#29305;&#23450;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#23550;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;<br>&#12381;&#12428;&#12382;&#12428;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12372;&#32057;&#20171;&#12356;&#12383;&#12375;&#12414;&#12377;&#12290;</p><p>- &#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#26041;&#27861;<br>Clean-MailboxDatabase &#12467;&#12510;&#12531;&#12489;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390; AD &#19978;&#12398;&#24773;&#22577;&#12398;&#20877;&#12473;&#12461;&#12515;&#12531;&#12392;&#12473;&#12488;&#12450;&#20869;&#12398;&#24773;&#22577;&#12398;&#26356;&#26032;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p><p>Get-MailboxStatistics -Database "&lt;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473; &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;&gt;" | ForEach { Update-StoreMailboxState -Database $_.Database -Identity $_.MailboxGuid -Confirm:$false }</p><p>- &#29305;&#23450;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#23550;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#26041;&#27861;<br>&#29305;&#23450;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12364;&#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#12424;&#12358;&#12394;&#29366;&#27841;&#12391;&#12399;&#12289;&#35442;&#24403;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#23550;&#12375;&#12390;&#12398;&#12415; Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;</p><p>&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12399; GUID &#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#29305;&#23450;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12395;&#23550;&#12375;&#12390; AD &#19978;&#12398;&#24773;&#22577;&#12398;&#20877;&#12473;&#12461;&#12515;&#12531;&#12392;&#12473;&#12488;&#12450;&#20869;&#12398;&#24773;&#22577;&#12398;&#26356;&#26032;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#21021;&#12417;&#12395;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398; GUID &#12434;&#21462;&#24471;&#12375;&#12390;&#12363;&#12425;&#12289;Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;<br>&#20197;&#19979;&#12398;&#20363;&#12391;&#12399;&#29305;&#23450;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12364;&#20999;&#26029;&#12373;&#12428;&#12383;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#29366;&#27841;&#12434;&#24819;&#23450;&#12375;&#12390;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#34920;&#31034;&#21517;&#12434;&#26465;&#20214;&#12395;&#12375;&#12390;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398; GUID &#12434;&#21462;&#24471;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p>1. &#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12289;&#23550;&#35937;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398; GUID &#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;</p><p>Get-MailboxDatabase "&lt;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;&gt;" | Get-MailboxStatistics | Where-Object {$_.DisplayName -eq "&lt;&#12518;&#12540;&#12470;&#12540;&#12398;&#34920;&#31034;&#21517;&gt;"} | fl DisplayName,MailboxGuid</p><p>&#20363;) <br>Get-MailboxDatabase "MDB01" | Get-MailboxStatistics | Where-Object {$_.DisplayName -eq "&#12510;&#12452;&#12463;&#12525; &#22826;&#37070;"} | fl DisplayName,MailboxGuid,Database</p><p>----- &#20986;&#21147;&#20363; -----<br>DisplayName : &#12510;&#12452;&#12463;&#12525; &#22826;&#37070;<br>MailboxGuid : 1b50af77-eb02-443f-a29d-5fd327f6b015<br>Database : MDB01<br>----- &#12371;&#12371;&#12414;&#12391; -----</p><p>&#12394;&#12362;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12364;&#12393;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12354;&#12427;&#12363;&#19981;&#26126;&#12394;&#22580;&#21512;&#12399;&#12289;"&lt;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;&gt;" &#12434;&#30465;&#30053;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12363;&#12425;&#35442;&#24403;&#12398;&#12513;&#12540;&#12523;&#12508;&#12483;&#12463;&#12473;&#12398;&#24773;&#22577;&#12434;&#25506;&#12377;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p><p>2. &#21069;&#12398;&#25163;&#38918;&#12391;&#30906;&#35469;&#12375;&#12383; GUID &#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395; Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p><p>Update-StoreMailboxState -Identity "&lt;GUID&gt;" -Database "&lt;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;&gt;" -Confirm:$False</p><p>&#20363;)<br>Update-StoreMailboxState -Identity "1b50af77-eb02-443f-a29d-5fd327f6b015" -Database "MDB01" -Confirm:$False</p><p>Update-StoreMailboxState &#12467;&#12510;&#12531;&#12489;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#20197;&#19979;&#12418;&#20341;&#12379;&#12390;&#12372;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;<br>Title : Update-StoreMailboxState<br>URL : http://technet.microsoft.com/ja-JP/library/jj860462(v=exchg.150).aspx</p><p>&#20170;&#24460;&#12418;&#24403;&#12502;&#12525;&#12464;&#12362;&#12424;&#12403;&#12469;&#12509;&#12540;&#12488; &#12481;&#12540;&#12512;&#12434;&#12424;&#12429;&#12375;&#12367;&#12362;&#39000;&#12356;&#12356;&#12383;&#12375;&#12414;&#12377;&#12290;</p></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="https://jpmessaging.github.io/blog/Display-disconnected-mailbox/" data-id="cml65tkq0001tyk2a0c2e3x4p" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/blog/tags/Exchange/" rel="tag">Exchange</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/blog/Autodiscover-in-Hybrid-Environments/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          ハイブリッド環境での Autodiscover

        
      </div>
    </a>
  
  
    <a href="/blog/Reflecting-on-Autodiscover-Episode-2/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">Autodiscover を振り返る エピソード 2
</div>
    </a>
  
</nav>

  
</article>

</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title"><a href="/blog/tags">Tags</a></h3>
    <div class="widget">
      <ul class="tag-list" itemprop="keywords"><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Copilot/" rel="tag">Copilot</a><span class="tag-list-count">4</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Exchange/" rel="tag">Exchange</a><span class="tag-list-count">60</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Exchange-Online/" rel="tag">Exchange Online</a><span class="tag-list-count">49</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Hybrid/" rel="tag">Hybrid</a><span class="tag-list-count">5</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/New-Outlook/" rel="tag">New Outlook</a><span class="tag-list-count">15</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/O365Identity/" rel="tag">O365Identity</a><span class="tag-list-count">8</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Outlook/" rel="tag">Outlook</a><span class="tag-list-count">13</span></li><li class="tag-list-item"><a class="tag-list-link" href="/blog/tags/Viva-Insights/" rel="tag">Viva Insights</a><span class="tag-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title"><a href="/blog/archives">Archives</a></h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2026/02/">February 2026</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2026/01/">January 2026</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/12/">December 2025</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/11/">November 2025</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/10/">October 2025</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/09/">September 2025</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/08/">August 2025</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/07/">July 2025</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/06/">June 2025</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/05/">May 2025</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/04/">April 2025</a><span class="archive-list-count">8</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/03/">March 2025</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/02/">February 2025</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2025/01/">January 2025</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2024/12/">December 2024</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2024/11/">November 2024</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2024/10/">October 2024</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2024/09/">September 2024</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2024/07/">July 2024</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2023/11/">November 2023</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2022/10/">October 2022</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2022/09/">September 2022</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2022/01/">January 2022</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/11/">November 2021</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/10/">October 2021</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/08/">August 2021</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/04/">April 2021</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/03/">March 2021</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/02/">February 2021</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2021/01/">January 2021</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2020/12/">December 2020</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2020/09/">September 2020</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2020/08/">August 2020</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2019/03/">March 2019</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2018/10/">October 2018</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2018/08/">August 2018</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2018/07/">July 2018</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2018/05/">May 2018</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2018/04/">April 2018</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/12/">December 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/11/">November 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/10/">October 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/09/">September 2017</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/07/">July 2017</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/02/">February 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2017/01/">January 2017</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/12/">December 2016</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/10/">October 2016</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/08/">August 2016</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/07/">July 2016</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/06/">June 2016</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2016/02/">February 2016</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/12/">December 2015</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/11/">November 2015</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/10/">October 2015</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/08/">August 2015</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/07/">July 2015</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2015/04/">April 2015</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2014/11/">November 2014</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2014/04/">April 2014</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2014/03/">March 2014</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2013/01/">January 2013</a><span class="archive-list-count">1</span></li><li class="archive-list-item"><a class="archive-list-link" href="/blog/archives/2012/11/">November 2012</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/blog/streamlined-moderation-approvals-now-in-all-outlook-clients/">すべての Outlook クライアントでモデレーション承認が効率化されました</a>
          </li>
        
          <li>
            <a href="/blog/trust-digicert-global-root-g2-certificate-authority-to-avoid-exchange-online-ema/">Exchange Online のメール中断を回避するため、DigiCert Global Root G2 認証局 (CA) を信頼してください</a>
          </li>
        
          <li>
            <a href="/blog/exchange-online-public-folder-data-and-retention-questions/">Exchange Online のパブリック フォルダーのデータおよび保持に関する質問</a>
          </li>
        
          <li>
            <a href="/blog/Introduction-to-the-Email-Template-Features-in-New-Outlook-for-Windows/">新しい Outlook for Windows のメール テンプレート機能の紹介</a>
          </li>
        
          <li>
            <a href="/blog/Updated-Exchange-Online-SMTP-AUTH-Basic-Authentication-Deprecation-Timeline/">Exchange Online における SMTP AUTH 基本認証廃止スケジュールの更新のご案内
</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2026 jpmessaging<br>      
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/blog/" class="mobile-nav-link">Home</a>
  
    <a href="/blog/archives" class="mobile-nav-link">Archives</a>
  
    <a target="_blank" rel="noopener" href="https://cssjpn.github.io/" class="mobile-nav-link">サポート情報</a>
  
    <a target="_blank" rel="noopener" href="https://techcommunity.microsoft.com/t5/exchange-team-blog/bg-p/Exchange" class="mobile-nav-link">US Exchange Blog</a>
  
    <a target="_blank" rel="noopener" href="https://techcommunity.microsoft.com/t5/outlook-blog/bg-p/Outlook" class="mobile-nav-link">US Outlook Blog</a>
  
    <a href="/blog/about" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


<script src="/blog/js/script.js"></script>




  </div>
</body>
</html>